kengdie_seminar/augusts/overview/gene_prediction.org
#+TITLE:     基因注释软件综述
#+AUTHOR:    asenal
#+EMAIL:     yuqiulin@genomics.cn
#+DATE:      2012-01-10 Tue
#+DESCRIPTION: RT
#+KEYWORDS: augustus,HMM
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP: 参数文件.html
#+LINK_HOME: /srv/www/htdocs/augustus/Doc/html/index.html

* 研究目标意义
先不扯
* 历史沿革
基因结构预测是序列注释的主要任务，是连接数据与功能的第一道通路。有应用价值的基
因预测工具从90年代开始出现，发展至今经历了四个阶段。根据应用对象不同，可分为原核基因预
测和真核基因预测；根据模型方法，可分为基于最长ORF，密码子使用频率表，同源数据
库比对，/italy/ *de novo* 方法等；这章笔记不意介绍所有软件和算法，而是大体
遵照时间顺序介绍Glimmer，Genescan，Augustus三个软件。理由有二：
+ 以上三个软件可用于原核基因与真核基因预测，在各自的应用环境，它们代表了领域内
  最成熟的模型和算法。
+ 这个时间顺序既反映我们对基因调控表达机理的认知过程，也反映算法对硬件的依赖，
  希望通过这样的回顾找到适应当前应用环境的改进思路。

  Genemark,Genie等利用《Prediction of Complete Gene Structures in Human Genomic DNA》[fn:2]
* Glimmer
* Genescan
Genescan 是1997年由Chris Burge 等人开发的真核基因预测程序，参考了同时代的Genie
并加入许多特性，是它成为当时最重要的真核预测软件之一。 
** 结构
+ Genescan 采用HMM架构，接受两方向，三个相位输入序列
+ 默认输入序列包含基因数量不等于1，可以预测不完整基因
+ 对promoter（P）和 poly-A（A）有单独建模
+ genescan 要求exon的相位和前一个intron相位相同，但是intron的相位可以和前面的 exon不同
+ intron视为donor splice site 与 branch acceptor/point 之间的部分，translatio
  initiation/termination signal 和 ass,dss 作为外显子的子模型存在。
+ 外显子
| F=5‘UTR  | transcription start -> translation initiation signal |
| E_single | translation start -> stop codon                      |
| E_init   | translation start -> dss                             |
| E_intern | ass ->dss                                            |
| E_term   | ass ->stop codon                                     |

** 模型
*** 长度分布
*** 状态转移
*** WWAM
*** MDD
见笔记
** 相位
GenScan has explicit structure to account for the frame position of “interrupting” intron
(Chris Burge 1997). It tracks “phase” (closely related to reading frame) of exons or
introns. Internal exons and introns are divided according to “phase”. An intron that is
between codons is in phase 0 (I0). An intron that is after the first base of a codon is in
phase 1 (I1). An intron that is after the second base of a codon is in phase 2 (I2).
Similarily, internal exons are divided according to the phase of the previous intron,
giving states E0, E1, and E2. For example, initial exons start at codon position p1 and end
at codon position pi such that i mod 3 is the phase of the following intron state. Internal
exons Ei start at codon position pi+1 and end at codon position pj , such that j mod 3 is the
phase of following intron. The terminal exons begin at codon position pi+1 and end at
codon position p3, where i is the phase of the previous intron.

* Augustus		
Augustus从Glimmer和Genescan 吸收成功经验，是目前比较成功的真核基因预测软件。它
采用HMM架构，接受两方向，三个相位输入序列。augustus有非常细致的子模型结构，但
是从描述来看，一些Genescan的优秀特性丢失了，主要是生物过程
相关的一些特征，这可能与作者的专业背景差异有关。

** 结构 
augustus的HMM是一个网状结构，由子模型构成节点，节点之间的转移概率控
制两个节点间的流量，一段序列如果被正确解码（给定参数），它在网上的整体流量在解
码路径上是最大的。
为整体理解augustus,下面列出模型间的剖分规则和限制条件：
+ 起始密码子是ATG
+ 终止密码子是TAA，TAG，TGA
+ 5' splice:GT
+ 3' splice:AG
+ AG(3'ass)->exon->GT(5'dss)
+ ASS模型包括branch point
+ 相位i表示最后一个密码子在外显子边界前i个碱基处终止
+ DSS，I_short,I_fixed,I_geo ，ASS 的相位是前一个外显子的相位，这个可以从图中看
  出来，ASS之后接外显子相位可以跳转，外显子之后接DSS相位不能跳转[fn:1]。
+ IR,I_fix ,I_geo ,ASS,DSS的长度分布是固定的
 
** 模型 
基因的结构可以很复杂，如果一个结构有强信号可以对其单独建模，augustus从 glimmer，genescan等早期软件中吸收经验，采用成熟算法捕捉强信号，构建子模型，从
结构说，augustus的子模型结构非常细腻，但是对HMM整体而言，子模型的划分并非越细越
好，容易产生过拟合，解空间复杂化等问题。augustus从敏感性特异性两个
指标计算了每个子模型对整体预测结果的贡献。

以下列表详细介绍每个生物结构用到的子模型：
| state    | submodels                                                                                                    |
|----------+--------------------------------------------------------------------------------------------------------------|
| E_single | translation initiation motif,start codon,initial pattern,initial content model,exon content model,stop codon |
| E_init   | translation initiation motif,start codon,initial pattern,initial content model,exon content model,           |
| E        | initial pattern,exon content model,internal 3'content model                                                  |
| E_term   | initial pattern,exon content model,stop codon                                                                |
| IR       | non-coding model                                                                                             |
| DSS      | dss model                                                                                                    |
| ASS      | branch point model,ass model                                                                                 |
| I_short  | non-coding model                                                                                             |
| I_fixed  | non-coding model                                                                                             |
| I_geo    | non-coding model                                                                                             |

** 长度分布
** 特点
* 问题							
以下是需要验证的部分：
+ 外显子两个四联体的经验分布是否是一个分布的频数和概率
+ IMM 400阈值的选择是否合适？查看glimmer
+ Genescan 好像也是有相位的（外显子和内含子都有），之前弄错？？并且有promoter和poly-A的单独建模
+ 比较一下genescan和augustus在方法和结构上的差异

* 备忘
+ human2的5联体只有概率向量，没有频数向量。fly的频数向量和概率向量是一回事，验证过程在Data文件夹。看代码相应位置吧。
+ doxygen 文档在http://172.16.74.2/augustus/Doc/index.html 中
+ 只有initial exon 有translation initiation motif,start codon,terminal exon 有stop codon，single exon 三者都有。
+ dss,branch point, ass 在生物结构上都是放在intron内的，但是在HMM实现可能不是 这样。


* Footnotes
[fn:1] this construction allows to account for the reading frame in the
emission distributjio of the eion states,and to exclude in-frame stop codons
in an exon sequence.
[fn:2] Chris Burge and Samuel Karlin, J.Mol.Biol(1997)268

  
