kengdie_seminar/augusts/overview/gene_prediction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>基因注释软件综述</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-10 Tue"/>
<meta name="author" content="asenal"/>
<meta name="description" content="RT"/>
<meta name="keywords" content="augustus,HMM"/>
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="参数文件.html"> UP </a>
 |
 <a accesskey="H" href="/srv/www/htdocs/augustus/Doc/html/index.html"> HOME </a>
</div>

<h1 class="title">基因注释软件综述</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 研究目标意义 </a></li>
<li><a href="#sec-2">2 历史沿革 </a></li>
<li><a href="#sec-3">3 Glimmer </a></li>
<li><a href="#sec-4">4 Genescan </a>
<ul>
<li><a href="#sec-4.1">4.1 结构 </a></li>
<li><a href="#sec-4.2">4.2 模型 </a>
<ul>
<li><a href="#sec-4.2.1">4.2.1 长度分布 </a></li>
<li><a href="#sec-4.2.2">4.2.2 状态转移 </a></li>
<li><a href="#sec-4.2.3">4.2.3 WWAM </a></li>
<li><a href="#sec-4.2.4">4.2.4 MDD </a></li>
</ul>
</li>
<li><a href="#sec-4.3">4.3 相位 </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Augustus </a>
<ul>
<li><a href="#sec-5.1">5.1 结构 </a></li>
<li><a href="#sec-5.2">5.2 模型 </a></li>
<li><a href="#sec-5.3">5.3 长度分布 </a></li>
<li><a href="#sec-5.4">5.4 特点 </a></li>
</ul>
</li>
<li><a href="#sec-6">6 问题 </a></li>
<li><a href="#sec-7">7 备忘 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 研究目标意义 </h2>
<div class="outline-text-2" id="text-1">

<p>先不扯
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 历史沿革 </h2>
<div class="outline-text-2" id="text-2">

<p>基因结构预测是序列注释的主要任务，是连接数据与功能的第一道通路。有应用价值的基
因预测工具从90年代开始出现，发展至今经历了四个阶段。根据应用对象不同，可分为原核基因预
测和真核基因预测；根据模型方法，可分为基于最长ORF，密码子使用频率表，同源数据
库比对，/italy/ <b>de novo</b> 方法等；这章笔记不意介绍所有软件和算法，而是大体
遵照时间顺序介绍Glimmer，Genescan，Augustus三个软件。理由有二：
</p><ul>
<li>
以上三个软件可用于原核基因与真核基因预测，在各自的应用环境，它们代表了领域内
最成熟的模型和算法。
</li>
<li>
这个时间顺序既反映我们对基因调控表达机理的认知过程，也反映算法对硬件的依赖，
希望通过这样的回顾找到适应当前应用环境的改进思路。

<p>
Genemark,Genie等利用《Prediction of Complete Gene Structures in Human Genomic DNA》<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>
</p></li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Glimmer </h2>
<div class="outline-text-2" id="text-3">

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Genescan </h2>
<div class="outline-text-2" id="text-4">

<p>Genescan 是1997年由Chris Burge 等人开发的真核基因预测程序，参考了同时代的Genie
并加入许多特性，是它成为当时最重要的真核预测软件之一。 
</p>
</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> 结构 </h3>
<div class="outline-text-3" id="text-4.1">

<ul>
<li>
Genescan 采用HMM架构，接受两方向，三个相位输入序列
</li>
<li>
默认输入序列包含基因数量不等于1，可以预测不完整基因
</li>
<li>
对promoter（P）和 poly-A（A）有单独建模
</li>
<li>
genescan 要求exon的相位和前一个intron相位相同，但是intron的相位可以和前面的 exon不同
</li>
<li>
intron视为donor splice site 与 branch acceptor/point 之间的部分，translatio
initiation/termination signal 和 ass,dss 作为外显子的子模型存在。
</li>
<li>
外显子
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>F=5‘UTR</td><td>transcription start -&gt; translation initiation signal</td></tr>
<tr><td>E<sub>single</sub></td><td>translation start -&gt; stop codon</td></tr>
<tr><td>E<sub>init</sub></td><td>translation start -&gt; dss</td></tr>
<tr><td>E<sub>intern</sub></td><td>ass -&gt;dss</td></tr>
<tr><td>E<sub>term</sub></td><td>ass -&gt;stop codon</td></tr>
</tbody>
</table>


</li>
</ul>
</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> 模型 </h3>
<div class="outline-text-3" id="text-4.2">


</div>

<div id="outline-container-4.2.1" class="outline-4">
<h4 id="sec-4.2.1"><span class="section-number-4">4.2.1</span> 长度分布 </h4>
<div class="outline-text-4" id="text-4.2.1">

</div>

</div>

<div id="outline-container-4.2.2" class="outline-4">
<h4 id="sec-4.2.2"><span class="section-number-4">4.2.2</span> 状态转移 </h4>
<div class="outline-text-4" id="text-4.2.2">

</div>

</div>

<div id="outline-container-4.2.3" class="outline-4">
<h4 id="sec-4.2.3"><span class="section-number-4">4.2.3</span> WWAM </h4>
<div class="outline-text-4" id="text-4.2.3">

</div>

</div>

<div id="outline-container-4.2.4" class="outline-4">
<h4 id="sec-4.2.4"><span class="section-number-4">4.2.4</span> MDD </h4>
<div class="outline-text-4" id="text-4.2.4">

<p>见笔记
</p></div>
</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3"><span class="section-number-3">4.3</span> 相位 </h3>
<div class="outline-text-3" id="text-4.3">

<p>GenScan has explicit structure to account for the frame position of “interrupting” intron
(Chris Burge 1997). It tracks “phase” (closely related to reading frame) of exons or
introns. Internal exons and introns are divided according to “phase”. An intron that is
between codons is in phase 0 (I0). An intron that is after the first base of a codon is in
phase 1 (I1). An intron that is after the second base of a codon is in phase 2 (I2).
Similarily, internal exons are divided according to the phase of the previous intron,
giving states E0, E1, and E2. For example, initial exons start at codon position p1 and end
at codon position pi such that i mod 3 is the phase of the following intron state. Internal
exons Ei start at codon position pi+1 and end at codon position pj , such that j mod 3 is the
phase of following intron. The terminal exons begin at codon position pi+1 and end at
codon position p3, where i is the phase of the previous intron.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Augustus </h2>
<div class="outline-text-2" id="text-5">

<p>Augustus从Glimmer和Genescan 吸收成功经验，是目前比较成功的真核基因预测软件。它
采用HMM架构，接受两方向，三个相位输入序列。augustus有非常细致的子模型结构，但
是从描述来看，一些Genescan的优秀特性丢失了，主要是生物过程
相关的一些特征，这可能与作者的专业背景差异有关。
</p>

</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> 结构 </h3>
<div class="outline-text-3" id="text-5.1">

<p>augustus的HMM是一个网状结构，由子模型构成节点，节点之间的转移概率控
制两个节点间的流量，一段序列如果被正确解码（给定参数），它在网上的整体流量在解
码路径上是最大的。
为整体理解augustus,下面列出模型间的剖分规则和限制条件：
</p><ul>
<li>
起始密码子是ATG
</li>
<li>
终止密码子是TAA，TAG，TGA
</li>
<li>
5' splice:GT
</li>
<li>
3' splice:AG
</li>
<li>
AG(3'ass)-&gt;exon-&gt;GT(5'dss)
</li>
<li>
ASS模型包括branch point
</li>
<li>
相位i表示最后一个密码子在外显子边界前i个碱基处终止
</li>
<li>
DSS，I<sub>short</sub>,I<sub>fixed</sub>,I<sub>geo</sub> ，ASS 的相位是前一个外显子的相位，这个可以从图中看
出来，ASS之后接外显子相位可以跳转，外显子之后接DSS相位不能跳转<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>。
</li>
<li>
IR,I<sub>fix</sub> ,I<sub>geo</sub> ,ASS,DSS的长度分布是固定的

</li>
</ul>
</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2"><span class="section-number-3">5.2</span> 模型 </h3>
<div class="outline-text-3" id="text-5.2">

<p>基因的结构可以很复杂，如果一个结构有强信号可以对其单独建模，augustus从 glimmer，genescan等早期软件中吸收经验，采用成熟算法捕捉强信号，构建子模型，从
结构说，augustus的子模型结构非常细腻，但是对HMM整体而言，子模型的划分并非越细越
好，容易产生过拟合，解空间复杂化等问题。augustus从敏感性特异性两个
指标计算了每个子模型对整体预测结果的贡献。
</p>
<p>
以下列表详细介绍每个生物结构用到的子模型：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">state</th><th scope="col">submodels</th></tr>
</thead>
<tbody>
<tr><td>E<sub>single</sub></td><td>translation initiation motif,start codon,initial pattern,initial content model,exon content model,stop codon</td></tr>
<tr><td>E<sub>init</sub></td><td>translation initiation motif,start codon,initial pattern,initial content model,exon content model,</td></tr>
<tr><td>E</td><td>initial pattern,exon content model,internal 3'content model</td></tr>
<tr><td>E<sub>term</sub></td><td>initial pattern,exon content model,stop codon</td></tr>
<tr><td>IR</td><td>non-coding model</td></tr>
<tr><td>DSS</td><td>dss model</td></tr>
<tr><td>ASS</td><td>branch point model,ass model</td></tr>
<tr><td>I<sub>short</sub></td><td>non-coding model</td></tr>
<tr><td>I<sub>fixed</sub></td><td>non-coding model</td></tr>
<tr><td>I<sub>geo</sub></td><td>non-coding model</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5.3" class="outline-3">
<h3 id="sec-5.3"><span class="section-number-3">5.3</span> 长度分布 </h3>
<div class="outline-text-3" id="text-5.3">

</div>

</div>

<div id="outline-container-5.4" class="outline-3">
<h3 id="sec-5.4"><span class="section-number-3">5.4</span> 特点 </h3>
<div class="outline-text-3" id="text-5.4">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 问题 </h2>
<div class="outline-text-2" id="text-6">

<p>以下是需要验证的部分：
</p><ul>
<li>
外显子两个四联体的经验分布是否是一个分布的频数和概率
</li>
<li>
IMM 400阈值的选择是否合适？查看glimmer
</li>
<li>
Genescan 好像也是有相位的（外显子和内含子都有），之前弄错？？并且有promoter和poly-A的单独建模
</li>
<li>
比较一下genescan和augustus在方法和结构上的差异

</li>
</ul>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 备忘 </h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>
human2的5联体只有概率向量，没有频数向量。fly的频数向量和概率向量是一回事，验证过程在Data文件夹。看代码相应位置吧。
</li>
<li>
doxygen 文档在<a href="http://172.16.74.2/augustus/Doc/index.html">http://172.16.74.2/augustus/Doc/index.html</a> 中
</li>
<li>
只有initial exon 有translation initiation motif,start codon,terminal exon 有stop codon，single exon 三者都有。
</li>
<li>
dss,branch point, ass 在生物结构上都是放在intron内的，但是在HMM实现可能不是 这样。






</li>
</ul>



</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> Chris Burge and Samuel Karlin, J.Mol.Biol(1997)268
</p>
<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> this construction allows to account for the reading frame in the
emission distributjio of the eion states,and to exclude in-frame stop codons
in an exon sequence.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: asenal
<a href="mailto:yuqiulin@genomics.cn">&lt;yuqiulin@genomics.cn&gt;</a>
</p>
<p class="date"> Date: 2012-01-10 Tue</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
